In [1]:
import pandas as pd

# **Creaci√≥n de un dataframe desde cero**

creacion de un df a partir de una lista de listas

In [2]:
data = [["ALUA",19.1], ["BBAR", 144.4], ["BYMA", 234]]

In [3]:
tabla = pd.DataFrame(data, columns=['ticker', 'precio'])
tabla

  ticker  precio
0   ALUA    19.1
1   BBAR   144.4
2   BYMA   234.0

creacion de un df a partir de un diccionario

In [4]:
data1 = {'tickers': ['GGAL', 'YPF', 'COME', 'ALUAR', 'HAVA'], 'precios': [4000,3600,1880,1493,3600]}
data1 = pd.DataFrame(data1)
data1

  tickers  precios
0    GGAL     4000
1     YPF     3600
2    COME     1880
3   ALUAR     1493
4    HAVA     3600

In [7]:
data2 = {'tickers': ['MACD', 'AAPL', 'CEME', 'ARGY', 'STBX'], 'precios': [400,900,180,1493,200]}
data2 = pd.DataFrame(data2, index=['activo_1', 'activo_2', 'activo_3', 'activo_4','activo_5'])
data2

         tickers  precios
activo_1    MACD      400
activo_2    AAPL      900
activo_3    CEME      180
activo_4    ARGY     1493
activo_5    STBX      200

creacion de un df a partir de una lista de diccionarios

In [8]:
data3 = [{'ticker': 'amzn', 'precio':19.2, 'tipo':'accion'},
         {'ticker': 'chv', 'precio':14.5, 'tipo':'accion'},
         {'ticker': 'petr', 'precio':20.7},
         {'ticker': 'hava', 'precio':11.9, 'tipo':'accion'}]
data3=pd.DataFrame(data3)
data3

  ticker  precio    tipo
0   amzn    19.2  accion
1    chv    14.5  accion
2   petr    20.7     NaN
3   hava    11.9  accion

In [9]:
data4 = [{'ticker': 'amzn', 'precio':19.2, 'tipo':'accion'},
         {'ticker': 'chv', 'precio':14.5, 'tipo':'accion'},
         {'ticker': 'petr', 'precio':20.7},
         {'ticker': 'hava', 'precio':11.9, 'tipo':'accion'}]
data4=pd.DataFrame(data4, columns=['ticker', 'precio'])
data4

  ticker  precio
0   amzn    19.2
1    chv    14.5
2   petr    20.7
3   hava    11.9

creacion de un df a partir de otro dataframe

In [10]:
apple = pd.read_excel('AAPL.xlsx', sheet_name='Hoja1')
df = apple[['timestamp', 'open', 'close']].copy().set_index('timestamp')
df.head()

              open   close
timestamp
2020-03-06  282.00  289.03
2020-03-05  295.52  292.92
2020-03-04  296.44  302.74
2020-03-03  303.67  289.32
2020-03-02  282.28  298.81

In [11]:
apple1 = pd.read_excel('AAPL.xlsx', sheet_name='Hoja1')
df1 = apple1.filter(['timestamp', 'open', 'close']).copy().set_index('timestamp')
df1.head()

              open   close
timestamp
2020-03-06  282.00  289.03
2020-03-05  295.52  292.92
2020-03-04  296.44  302.74
2020-03-03  303.67  289.32
2020-03-02  282.28  298.81

In [12]:
apple2 = pd.read_excel('AAPL.xlsx', sheet_name='Hoja1')
df2 = apple2.drop(columns=['high', 'low'], axis=1).copy().set_index('timestamp')
df2.head()

              open   close  adjusted_close    volume
timestamp
2020-03-06  282.00  289.03          289.03  56544246
2020-03-05  295.52  292.92          292.92  46893219
2020-03-04  296.44  302.74          302.74  54794568
2020-03-03  303.67  289.32          289.32  79868852
2020-03-02  282.28  298.81          298.81  85349339